[
(c
  (h3 
    `من و کنکور 1404 مهندسی کامپیوتر`))

(hr)
(h4 
  `پیش گفتار`)

(p
  `این متن خاطرات و برداشت ها و توصیه های من برای کنکور ارشد مهندسی کامپیوتر سال 1404 هست.` _ 
  `سعی کردم عکس و ایموجی به متن اضافه کنم که موقع خوندن احساس یکنواختی نکنید.` _ 
  `امیدوارم مفید واقع بشه . 🌹 `
  )

(hr)
(h4 
  `انگیزه برای خوندن` _ 
  `🌟`)

(p
  `زمانی که ترم 8 بودم، همش نگران این بودم که درسم رو چطور تموم کنم و بعدش چیکار کنم 😥.`
  `در همین حال، یکی از همکلاسیام` _ 
  (b `رتبه تک رقمی`) _ 
  `کنکور شده بود.` _ 
  `با این اتفاق راستش` _ 
  (i `منم رتبه خوب شدن رو چیز دوری ندیدم`) _
  `و تصمیم گرفتم که شروع کنم.` _ 
  )

(p
  `علاوه به اون، جو غیر علمی دانشگاه دوره کارشناسی واقعا من رو از این دانشگاه زده کرد.` _ 
  `خیلی سخته بخوام همه اش رو بگم ولی مهم ترینش این بود که آدمای اطرافم مخصوصا جایی که کار میکردم، خیلی جاهل بودن.  ` _ 
  `اینطوری بودن که فکر میکردن چون توی فلان شرکت کار میکنن دیگه الان خدای کامپیوتر و برنامه نویسی اند و حرف های منطقی من رو گوش نمیکردن.` _ 
)

(p
  `جالبه بدونید چنین آدم هایی بر اساس ریاضی دبیرستان توصیف میشن:` _ 
  (b `آدم های اکسترمم نسبی`)
)

(img "local-maxima.png" "height: 300px")

(p 
  `این آدم ها بخاطر جاهلیت شون فکر میکنن چیزی که الان هستن آخر دانش هست و درست  ترین روش پیشرفت رو در پیش گرفتن.` _ 
  `اما در صورتی که با واقعیت خیلی فاصله دارن.`
  )

(p
  `عدم توجه مسئولین دانشگاه به رشته مهندسی هم من رو به شدت عصبانی میکرد و ` _
  (b `واقعا پیشرفت خودم رو توی این دانشگاه نمیدیدم.`) _ 
  `علاوه بر اون اگر ادامه تحصیل نمیدادم باید میرفتم سربازی.` _

  `یادم میاد دقیقا یکسال قبل این تصمیم، به خدا میگفتم که` _ 
  (i 
    `یعنی قراره بعد از دانشگاه چیکار کنم؟؟`))

(hr)
(h4 
  `روند` _ 
  `♻`)


(p
 `نزدیکای ماه مهر بود که شروع کردم.` _ 
 `پکیج نکته و تست سایت` _ 
 (a "https://www.konkurcomputer.ir/" `کنکور کامپیوتر`) _ 
 `رو خریدم، صرفا بخاطر اینکه همکلاسی ام که رتبه تک رقمی شده بود هم از همین سایت خریده بود.`)

(p
  `اون موقع ترم 9 بودم و درس زیادی نداشتم. صرفا یکی دوروز دانشگاه بودم و اون روز ها هم فقط یک کلاس داشتم.` _
  `البته هفته ای یکروز هم دور کار (برنامه نویسی) برای یک شرکت انجام میدادم ولی زودی تمومش کردم و نذاشتم خیلی به درس خوندنم لطمه بزنه`
  )

(p
  `اوایل که شروع کردم یکمی وسط درس خوندن خوابم میبرد، بخشی از پولی که بدست اورده بودم` _ 
  `رو صرف خرید لوازم ورزشی مثل` _

  (a `https://www.digikala.com/product/dkp-6497713/لوازم-تناسب-اندام-تی-آر-ایکس-تی-آر-ایکس-مدل-فورس-کیت/` `این`) _ 
  `و` _ 
  (a `https://www.digikala.com/product/dkp-8519098/کش-ورزشی-تن-زیب-مدل-ضربدری-corex-30lb/` `این`) _ 

  `کردم و هر موقع که احساس خواب آلودگی میکردم یکم باهاشون کار میکردم تا بتونم درس خوندن رو ادامه بدم.`
  )

(p
  `تقریبا از صبح تا شب درس میخوندم (به علاوه استراحت های وسطش).` _ 
  `اینطوری که صبح برای نماز صبح بیدار میشدم و میرفتم مسجد. بعد که میومدم خونه،` _ 
  `یکم ورزش میکردم و بعد صبحونه میخوردم و مینشستم پای درس` _ 
  (sm 
    `(البته بعضی موقع ها هم این برنامه بهم میریخت)`)
)

(p
  `از روزی 4 یا 5 ساعت شروع کردم و کم کم بیشتر شد.` _ 
   `یادمه اولین باری که 12 ساعت درس خوندم تا دو روز تب کردم` _ 
  `تصمیم گرفتم که در حد همون روزی 10 ساعت باقی بمونه.` _ 
  (sm
    `البته چند باری هم بیشتر میشد که عاقبتش مثل قبل باعث تب کردنم میشد 😅` )
)

(p
  `واقعا اون روز ها بهترین دوران زندگی ام بود.`
  )

(hr)
(h4
  `کیفیت دوره ها` _ 
  `🧪`)

(p
  `من` _ 
   (a `https://cafetadris.com/ceit_teachers/course/4713-%D9%BE%DA%A9%DB%8C%D8%AC-%DB%B1%DB%B2-%D9%86%DA%A9%D8%AA%D9%87-%D9%88-%D8%AA%D8%B3%D8%AA-%DA%A9%D9%86%DA%A9%D9%88%D8%B1-%D8%A7%D8%B1%D8%B4%D8%AF-%D9%85%D9%87%D9%86%D8%AF%D8%B3%DB%8C-%DA%A9%D8%A7%D9%85%D9%BE%DB%8C%D9%88%D8%AA%D8%B1`
       `بسته "12 نکته و تست" سایت کنکور کامپیوتر`) _ 
   `رو خریدم` _ 
  (sm `(یعنی درسنامه نخریدم)`) _ 
  `و نظرم در مورد هر کدوم اینطوریه:`
)

(h5 
  `1. شبکه های کامپیوتری`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`) _ `تقریبا هیچ` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `تقریبا هیچ` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `فهم و تسلط نسبی` )
  (sp (b `تلاش برای یادگیری`) `:` _ `زیاد` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `راضی` )
  )

(img `IP-hourglass.jpg` `height: 300px`)

(p
  `کلاس های ضبط شده واسه سال 1401 بود که با اغتشاشات همراه شده بود.` _ 
  `با اینکه من دوره "نکته و تست" گرفته بودم ولی درسنامه هم داشت.` _ 
  `شاید فکر کنید که این مورد خوبه اما به شدت کیفیت درس دادن پایین بود و در حد جزوه نویسی و تست حل کردن بود.` _ 
  `حتی تست حل کردن ها هم بدرد نمیخوره چون چند سالی هست که شبکه اصلا سوال محاسبه ای نداره و همه اش حفظی یا مفهومیه.` _ 
  `همون اول قید خوندن شبکه رو زدم، تا اینکه یکی از دوستان عزیزم بهم` _
 _
  (a
    `https://cshub.ir/product/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D9%88-%D8%AA%D8%B3%D8%AA-%D9%85%DB%8C%DA%A9%D8%B1%D9%88-%D8%B4%D8%A8%DA%A9%D9%87-%D9%87%D8%A7%DB%8C-%DA%A9%D8%A7%D9%85%D9%BE%DB%8C%D9%88%D8%AA%D8%B1%DB%8C/`
    `دوره میکرو شبکه`) _ 

  `رو معرفی کرد. این دوره درحال ضبط📹 بود` _ 
   `و طوری نبود که همه چیز رو متوجه بشید. حتی به نظرم اشتباهاتی هم داشت.` _ 
    `اما یکسری خوبی داشت که جای دیگه پیدا نکردم:`
)

(ul
  (sp `دوره کوتاه بود و تست هم حل میکرد`)
  (sp `استاد منبع برای توضیح بیشتر معرفی میکرد و مثل استاد مغرور کنکور کامپیوتر ادعا های الکی نداشت`)
  )

(p
  `این موارد باعث شد که با منابعی که خود نویسنده کتاب تولید کرده و` _ 
  (b `رایگان`) _ 
  (a `https://gaia.cs.umass.edu/kurose_ross/index.php` `به اشتراک گذاشته`) _ 
  `آشنا بشم، که واقعا هم کم نبودن:`
  )

(ul
  (sp `خود کتاب`)
  (sp `سوال های حل شده آخر فصل`)
  (sp `اسلاید و ویدئوی درسنامه`)
  (sp `سایت آزمون`)
  )

(p
  `همه اینا مجانی توی اینترنت بود!` _ 
  `یعنی از اساتید کنکور گرامی دانشجو رو گول میزنن وقتی که مینویسن:` _ 
  (i `"آموزش شبکه های کامپیوتر + حل تمرینات آخر فصل"`) _ 
  `چون حل تمرینات آخر فصل اصلا توی اینترنته!` _ 
  `همینطور اسلاید ها و درسنامه!`
  )

(p 
  `دوره رو تا جایی که ضبط شده بود دیدم، بعد کتاب رو هم تا کامل خوندم و علامت زدم.` _ 
  `جواب تمرینات آخر فصل هم دانلود کردم و در مورد در مبحثی که هنوز هم واسم سوال بود،` _ 
  `توی` _ 
  `youtube` _ 
  `جستجو میکردم و میدیدم.` _ 
  `دوره رایگان` _  
  (a `https://www.youtube.com/playlist?list=PLIFyRwBY_4bRLmKfP1KnZA6rZbRHtxmXi` `Networking Fundamentals`) _ 
  `از کانال` _ 
  (a `https://www.youtube.com/channel/UCKmU-GKiukM8LYjkJFb8oBQ` `Practical Networking`) _ 
  `خیلی مفید بود`
)

(h5 
  `2و3`_ 
  `ساختمان داده و طراحی الگوریتم`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`) `:` _ `کم` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:`  _ `خیلی خیلی کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `فهم و تسلط نسبی` )
  (sp (b `تلاش برای یادگیری`) `:` _ `خیلی زیاد` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `قابل قبول، ولی سوالاتش خیلی فرق کرده بود و چند تا سوال سلیقه ای هم داشت. از خیلی از مباحث هم سوال نداده بود` )
  )

(img `ds-fun-cristmas-tree-heap.png` `height: 320px`
  `Cristmas Tree & Heap`)

(p 
  `از این که نگم براتون خیلی خیلی بد و وقتگیر بود.` _ 
  `یک نکته ای که باید توجه داشته باشید، اینه که استاد رضوی کلا اعتقاد زیادی به فهمیدن ندارن و بیشتر روی تقلید و حفظیات کار میکنن.` _ 
  `و این مورد توی این دو تا درس خیلی نمود پیدا کرده. من بعد از زدن دیدن و زدن کل تست های این دوتا درس، واقعا چیز زیادی حالیم نبود.` _ 
  `استاد رضوی بخاطر توجیه ضعف خودش توی این دو تا درس یکبار گفت که:` _ 
  (i
    `ساختمان داده و الگوریتم واسه المپیادی ها و آدمای تیز هوشه🧠.`) _ 
  `البته ایشون در طول دوره ادعا کرده بودن که بهترین دوره ساختمان داده در کشور رو تهیه کردن 🥇`
  )

(p 
  `به وقت جمع بعدی که رسیدم، متوجه شدم که چیز زیادی از این دوتا درس متوجه نشدم.` _ 
  `در همین موقع ها که` _ 
  (a `https://cshub.ir/%d9%be%d8%a7%d8%b3%d8%ae-%d8%aa%d8%b4%d8%b1%db%8c%d8%ad%db%8c-%da%a9%d9%86%da%a9%d9%88%d8%b1-%d8%a7%d8%b1%d8%b4%d8%af-%da%a9%d8%a7%d9%85%d9%be%db%8c%d9%88%d8%aa%d8%b1/`
       `حل رایگان ویدئویی سوال های کنکور سال های اخیر`) _ 
  `رو پیدا کردم بودم، دیدم که` _ 
   (i `آقای دکتر گیلک`) _ 
   `از` _ 
  (a `https://babanacademy.com/` `موسسه بابان`) _ 
  `خیلی بهتر سوال هارو حل میکنه.` _ 
  `تصمیم گرفتم که ویدئوی های ایشون` _ 
   (sm `(اونایی که در آپارات به صورت رایگان قرار داشت)`) _ 
   `رو ببینم.` _ 
   `سوالات کارشناسی ارشد رو تموم کردم و دیدم که ایشون برای مقطع دکترای همین درس هم ویدئوی رایگان گذاشتن.` _ 
   `شروع کردم اونا رو هم دیدم.`
  )

(p
  `نحوه بیان ایشون خیلی خیلی بهتر بود.` _ 
  `مشکلی که در طی دیدن این ویدئو های ایشون متوجه اش شده بودم این بود که من در خیلی از مواقع درسنامه رو هم بلد نبودم.` _ 
  `چند تا راه حل داشتم:`
  )

(ol
  `برم دوره درسنامه استاد گیلک رو بخرم و ببینم`
  `کتاب رو بخونم`
  `از تو اینترنت مباحث رو پیدا کنم.`
  )

(p 
  `خب من مورد سوم رو انتخاب کردم اما باز هم نمیتونستم تست های مربوط به اون مباحث رو بزنم.` _ 
  `متوجه شدم که` _ 
  (i `نیاز به درسنامه دارم.`)

  `اول رفتم سراغ` _ 
  (a `https://maktabkhooneh.org/course/%D8%B3%D8%A7%D8%AE%D8%AA%D9%85%D8%A7%D9%86-%D8%AF%D8%A7%D8%AF%D9%87-%D9%87%D8%A7-mk118/#chapter`
    `دوره ساختمان داده دانشگاه شریف در سایت مکتب خونه`) _ 
    `.` _ 
  `که به نظرم اولا از لحاظ کیفیت صدا و تصویر خوب نبود و` _ 
  `بعد هم استاد روی یک تخته وایتبورد با ماژیک به صورت خیلی کج مینوشت که واقعا بدم اومد و بیخیالش شدم`
  )

(p 
  `توی اینترنت به انگلیسی دنبال درسنامه بودم که چند تا ویدئو از` _ 
  (a `https://ocw.mit.edu/search/?q=` `دانشگاه MIT`) _ 
  `پیدا کردم. من که چیزی واسه از دست دادن نداشتم، با خودم گفتم که:`
  (i `حالا برو ببین اینو فوقش نمیفهمی و این دو تا درس رو حذف میکنی...`)
  )

(p 
  `ویدئو رو از یوتیوب با` _ 
  (a `https://cobalt.tools/` `این ابزار`) _ 
  `دانلود کردم و نشستم به دیدن.` _
  (sm `(شنیداری انگلیسیم بد نیست و میتونم بفهمم)`) _
  `آقا منو میگی؟ برای اولین بار توی زندگیم داشتم الگوریتم میفهمیدم.` _ 
  `از استادش خیلی خوشم اومده بود و جلسات دیگه اش رو هم دانلود کردم.` _ 
  `اما متوجه شدم که درس الگوریتم رو چند تا استاد تدریس میکنن، یعنی همه جلسات رو یک استاد ارائه نمیده.` _ 
  `خوشبختانه متوجه شدم ترم های دیگه که این درس ارائه شده، همین اساتید مباحث دیگه ای رو ارائه دادن.` _ 
  `منم با خوشحالی دوره سال های دیگه این استاد عزیز رو در سال های 2020 و 2014 و 2011 و 2005 دانلود کردم.` _ 
  `نکته ای که توجه من رو به خودش جلب کرده بود، چهره استاد بود که توی سال 2020 هم نسبتا جوان به نظر میرسید!` _
  `توی دوره سال 2005 هم که دیگه خیلی خیلی جوون بود. همون موقع توی اینترنت در مورد جستجو کردم و دیدم که سن ایشون رو زده 43.` _ 
  `توی ذهنم گفتم که:` _ 
  `اگر سال 2025 ایشن 43 سال اش باشه، یعنی توی دوره 2005 که تدریس میگه سن ایشون میشه:`
  )
(ltx `43 - (2025 - 2005) = 43 - 20 = 23!!`)

(p 
  `این سن واقعا برای یک استاد دانشگاه خیلی سن کمی هست!` _ 
  `در ادامه خوندم: ` _ 
  `ایشون در سن 7 سالگی به عنوان نخبه شناسایی شده و 12 سالگی رفته دانشگاه و 14 سالگی لیسانس اش رو گرفته.` _ 
  `مدرک دکترا اش هم تا 20 سالگی تونسته بگیره...`
  )

(img `eric-demaine.jpg` `height: 300px`
  (p `Eric Demaine`))

(p
  `نشستم تقریبا همه ویدئو های ساختمان داده و الگوریتم اش رو دیدم،` _ 
  `واقعا محشر بود.` _ 
  `حتی یک اشتباهی از یکی از ویدئو های دکتر گیلک پیدا کردم و` _ 
   (a `https://www.aparat.com/v/ufukfau` `براشون فرستادم`) _ 
  `که درستش رو از کلاس استاد آقای` _ 
  `Demaine` _ 
  `یادگرفته بودم...`
  )

(h5 
  `4. `
  `سیستم عامل`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`) _ `خوب` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `متوسط` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `فهم و تسلط خوب` )
  (sp (b `تلاش برای یادگیری`) `:` _ `متوسط` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `راضی، ولی سوالات خیلی چرند بودن` )
  )

(p 
  `این یکی بد نبود، ولی ویدئو های رایگان` _ 
  (a `https://babanacademy.com/` `موسسه بابان`) _
  `هم خوب بود.` _ 
  `به نظرم استاد یوسفی` _ 
  (a `https://www.youseficlass.ir/` `استاد یوسفی`) _ 
  `خوب تدریس میکنن.` _ 
  `توی این مورد نظری ندارم که کدوم بهتره.`
  )

(p 
  `اما کلا مباحثی بودن که به نظرم هیچ کدوم از اساتیدی که ذکر کردم خوب توضیح ندادن.` _ 
  `این موارد رو توی اینترنت پیدا کردم:`
  )

(ol 
   (sp `ا ` (a `https://faculty.ksu.edu.sa/sites/default/files/tutorial_07.pdf`
     `فرق بین` _ 
    `deadlock` _ 
    `و` _ 
    `starvation`
    ))
    (a `https://cs.gmu.edu/~rcarver/ModernMultithreading/LectureNotes/Chapter2Notes.pdf`
        `شرایط` _ 
      `DeadLock`))

(p 
  `علاوه بر متوجه شدم که انگار دانشگاه های خارجی مثل ما انقد روی این کتاب لامصب تاکید ندارن و`
   `کلا جور دیگه ای کلاسشون برگزار میشه، مثلا به صورت آزمایشکاه`)

(p 
  `کلا سیستم عامل درسیه که همه چی بستگی به طراح داره. میتونه سوالات رو به صورت` _ 
   `چرت ترین حالت ممکن طرح کنه که همه رو منفی بزنید.` _ 
   `من خودم دستیار استاد`_ 
  (sm `(TA)`) _ 
  `درس سیستم عامل بودم و میتونم بگم واقعا چرند ترین درس کنکور همین سیستم عامل بود`
   )

(h5 
  `5. `
  `مدار الکترونیکی`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`) _ `هیچ` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `هیچ` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `کم` )
  (sp (b `تلاش برای یادگیری`) `:` _ `خیلی کم` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `راضی، یدونه بیشتر نزدم` )
  )

(p 
  `فقط فصل اول و سوال های خیلی ساده از این درس رو خوندم و نظری در این رابطه ندارم.` _ 
  `کتاب این درس رو هم دانلود کردم ولی چنگی به دل نمیزد، کلا منصرف شدم`
  )

(h5 
  `6. `
  `معماری کامپیوتر`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`) _ `کم` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `روی مسائل تکراری و محاسباتی تسلط داشتم ولی فهم واسم مشکل بود` )
  (sp (b `تلاش برای یادگیری`) `:` _ `نسبتا زیاد` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `نبست به وقتی که گذاشتم، ناراضی` )
  )

(p 
  `راستش رشته استاد رضوی توی ارشد سخت افزار بوده و طبیعیه که این درس رو خوب بگن.` _ 
  `اما بازم بخاطر مفهومی شدن سوالات، اووووننن هممممهههه تستی که حل کرد سرکلاسش واقعا کمک زیادی نکرد.` _ 
  `تستایی که حل میکردن اکثرا تکراری بود و روی مفهوم تاکیدی نداشتن.` _ 
  `علاوه بر اون، بیشتر تست ها قدیمی بودن و فقط دوره خاصی تکرار میشدن.`
  )

(p 
  `علاوه بر اون یکسری مفاهیم رو اصلا پوشش ندادن که خب توی کنکور های جدید طراح ها از این موضوع استفاده کردن و مچ گرفتن.` _ 
  `شاید توی درسنامه این موراد رو پوشش داده باشن ولی با توجه به زمان خیلی طولانی ویدئو ها، دیدن همه درسنامه و نکته و تست اصلا کار منطقی نیست.` _ 
  `در نهایت منظورم اینه که باید کتاب مانو رو فول باشید و شیوه سوال دهی ممکنه فرق کنه`
  )

(p 
  `علاوه بر اون مبحثی توی تست ها بود به نام ساختار` _ 
  `Cache` _ 
  `که با اینکه استاد خیلی خیلی تست ازش حل کردن اما من همچنان توی تشخیص و حل اش مشکل داشتم.` _ 
  `تا اینکه توی اینترنت` _ 
  (a `https://csillustrated.berkeley.edu/PDFs/handouts/cache-3-associativity-handout.pdf`
    `این فایل`  _ 
    `PDF`) _ 
  `رو پیدا کردم`
  )

(h5 
  `7. `
  `مدار منطقی`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`) _ `متوسط` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `قابل قبول` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `تسلط روی مسائل محاسباتی و تکراری و فهم نسبی` )
  (sp (b `تلاش برای یادگیری`) `:` _ `نسبتا زیاد` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `قابل قبول، ولی سوالات هم خیلی عجیب غریب بود به نظرم` )
  )

(p 
  `به نظرم جدای از نحوه تدریس، سوالای مدار منطقی یکم عجیب و غریب شدن.` _ 
  `اینم مثل درس معماری کامپیوتر، اگر هیچی بلد نباشید، سر کلاس نکته و تست یادمیگیرد اما اون همممههههه تست لازم نبود چون بیشترش تکراری بود.`
  )

(h5 
  `8. `
  `نظریه زبان ها`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _ `متوسط` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `قابل قبول` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `غیر از لم تزریق و اثبات ها بقیه رو بلد بودم` )
  (sp (b `تلاش برای یادگیری`) `:` _ `خوب` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `عالی، البته به نظرم سوالاتش هم آسون بود` )
  )

(p 
  `استاد کاشفی این دوره رو تدریس میکردن، میتونید بدون داشتن درسنامه هم یادبگیرید.` _ 
  `تست حل کردن استاد کاشفی بین بقیه درس ها و استاد های کنکور کامپیوتر بهترین بود،`
   `ولی ایشون هم خیلی تست حل کردن و به نظرم نیاز نبود. دکتر گیلک از موسسه بابان هم خوب بود.` _ 
   `هردو خوب بودن، نمیتونم بهترین رو انتخاب کنم`
  )

(p
  `از رو کتاب مطالب رو میخوندم و اگر نیاز به  اثبات یا فهم عمیق تر داشتم،` _ 
  `از کانال یوتیوب` _ 
  (a `https://www.youtube.com/c/EasyTheory` `easy theory`) _ 
  `میدیدم، به نظرم عالی بودن ایشون. حتی ی ایمیل هم به عنوان تشکر به مدیر کانالش فرستادم.`
)

(img `closure-properties.jpg` `height: 300px` `Easy Theory`)

(p
  `استاد کاشفی` _ 
   (a `https://t.me/turingacademy` `ی کانال تگلرام`) _ 
   `داره که خلاصه بعضی مطالب رو اونجا میزاره، به نظرم حتما توش عوض بشید`
  )

(h5 
  `9. `
  `پایگاه داده`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _(sp  
    `زیاد، چون `
    `SQL`
    `بلد بودم و توی برنامه هام از دیتابیس استفاده کرده بودم`) )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `تقریبا کامل` )
  (sp (b `تلاش برای یادگیری`) `:` _ `خوب` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `عالی` )
  )

(p 
  `پایگاه داده اش متوسط بود ولی من راضی نبودم چون به نظرم نتونست "مفهوم" رو منتقل کنه .` _
  `ویدئو های رایگان دکتر خیلی از موسسه بابان خیلی بهتر بود.`
  )

(p 
  `خیلی بیش از اندازه تست در مورد "جبر رابطه ای" حل کردن که خب حتی یک تست هم ازش نیومد.`
  `چند سالیه که کلا تست های جبر رابطه ای کم میاد و تمرکز ایشون روی جبر رابطه ای مورد سواله...`
  )

(p 
  `به نظرم ایشون مفهوم رو خیلی خوب منتقل نمیکردن، مثلا من برای فهم عملگر تقسیم توی جبر رابطه ای،` _ 
  `توی اینترنت از ی استاد دانشگاه آمریکایی ی چیزی پیدا کردم که کامل موضوع رو برام روشن کرد ولی` _ 
  `هر چقد فیلمای آقای خانی از کنکور کامپیوتر رو میدیدم، متوجه نمیشدم.` _ 
  (a `https://www2.cs.arizona.edu/~mccann/research/divpresentation.pdf` `این لینک ارائه خارجیه`) _ 
  `که حتی به استادش ایمیل زدم و ازش تشکر کردم.`
  )

(p 
  `برای مبحث نرمال سازی هم نه ایشون و نه استاد خیلی فر از موسسه بابان خوب تدریس نکردن.` _ 
  `در نهایت توی اینترنت` _ 
  (a `https://kitsugo.com/tool/database-normalizer/` `ی برنامه پیدا کردم`) _ 
  `که کامل متوجه شدم. ی ایمیل به سازنده اش هم زدم و ازش تشکر کردم:`
  )

(img `kitsugo-thanks-email.jpg` `height: 400px`
  (sp `نامه به` _  `Kitsugo`))

(p 
  `البته کتاب این درس رو هم خوندم ولی به نظرم به جز فصل های اول چندان بدردم نخورد.` _ 
  `تعاریفی مثل` _ 
  `LossLess` _ 
  `رو اصلا نه اساتید و نه کتاب خوب توضیح ندادن.` _ 
  `اینا رو از تو اینترنت پیدا کردم که خیلی خوب بود:`
  )

(ul
  (sp
    `شبیه ساز` _  
    (a `https://dbis-uibk.github.io/relax/landing` 
      `جبر رابطه ای`))
  (sp 
    `توضیح` _ 
    (a `https://sidorova.win.tue.nl/informatica6/some-solutions-chapter7.pdf`   
      `Loss Less`))
  (sp
    `توضیح` _ 
    (a `http://infolab.stanford.edu/~ullman/fcdb/spr99/lec14.pdf` `Loss Less` ))
  (sp
    (a `https://gateoverflow.in/` `انجمن کنکور هندی ها`) `:` _
    `کنکور اونا شبیه ماست و سوالای مشابه زیاد میتونید پیدا کنید`
    )
)

(h5 
  `10. `
  `هوش مصنوعی`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _ `هیچ` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `هیچ` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `عدم فهم عمیق` )
  (sp (b `تلاش برای یادگیری`) `:` _ `تقریبا زیاد` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `نسبت به تلاش، ناراضی - ولی به نظرم سوالاتش هم نکته دار و مچ گیرانه بود` )
  )

(img `genetic-algo.jpg` `height: 320px` `الگوریتم ژنتیک`)

(p
  `این تنها درسی بود که حتی درسنامه اش هم خریدم.` _ 
  `با اینکه خیلی روش وقت گذاشته بودم اما،` _ 
  `بخاطر عدم تمرکز استاد رضوی روی "فهمیدن"، نتونستم مفاهیم رو درست متوجه بشم و سوال های ساده ای رو از دست دادم.` _ 
  )

(p 
  `از عدم فهم خودم با خبر بودم و سعی کردم توی اینترنت مثل دوره الگوریتمی که بالاتر توضیح دادم،` _
  `مطالب و ویدئو پیدا کنم اما متاسفانه خیلی در موردش منابع کم بود.` _ 
  `که واقعا نمیدونم چرا ولی حدس میزنم که دانشگاه های خارجی از روی این کتاب درس نمیدن حداقل...`
  )

(p 
  `من حتی برای فهم عمیق تر فصل` _ 
  `"منطق گزاره ای"` _ 
  (a `https://www.cs.trincoll.edu/~ram/cpsc352/notes/prolog/factsrules.html` 
    `زبان` _ 
    `Prolog` _ 
    `رو یادگرفتم` _ )
    `؛ اما سوال از همون فصل رو اشتباه زدم.`
  )

(ul
  (sp 
  `استثنائا` _
   (a `https://www.cs.sjsu.edu/faculty/pollett/156.1.04s/Lec13022004.pdf` `این مطلب` _ )
    `رو در مورد بهبود های روی ` _ 
  `A*` _ 
  `پیدا کردم که بهتر از جزوه استاد رضوی توضیح داده`
  )

(sp
  `این یکی هم در مورد الگوریتم` _  
  
  (a `https://www.youtube.com/watch?v=qnEhZFH9gXw` 
    `DPLL`) _ 
  `خوب توضیح داده`
  )
)

(p 
  `در نهایت به نظرم اگر قصد خرید دارید، دکتر گیلک از موسسه بابان خیلی بهتر توضیح میده...`)

(h5 
  `11. `
  `سیگنال و سیستم`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _ `کم` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `خیلی کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `کم` )
  (sp (b `تلاش برای یادگیری`) `:` _ `کم، البته استاد دوره رو ماست مالی کرد` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `نسبتا ناراضی، از کجا باید میدونستم که زمان منفی میشه؟؟!؟` )
  )

(p 
  `کلاس نکته و تستش نزدیکای کنکور شروع به ضبط شد و کیفیتش به نظرم به شدت بد بود.` _ 
  `در حد کلاهبرداری بود چون خیلی خیلی کم تست حل کردن و کار عجله ای شد.` _ 
   `از هر موسسه ای بگیرید به نظرم بهتر از اینه.` _ 
  `استاد این درس همون استاد پایگاه داده بود`
  )

(h5 
  `12. `
  `ریاضیات گسسته`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _ `کم` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `خیلی کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `خوب` )
  (sp (b `تلاش برای یادگیری`) `:` _ `نبستا خوب` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `راضی` )
  )

(img `lattice.jpg` `height: 400px ` `Hasse diagram of a Lattice`)

(p 
  `گسسته اش خوب بود ولی دکتر گیلک و دکتر یوسفی به همون اندازه خوب بودن`
  (sm `(بر اساس ویدئو های رایگان شون توی آپارات)`)
  )

(p 
  `از این درس واقعا خوشم اومد و باعث شد برم کتابشو بخونم که با مباحثی مثل` _ 
  `Lattice`  _ 
  `و` _ 
  `POSet` _ 
  `آشنا شدم که خیلی شیرین بود.` _ 
  `در مورد گراف ها هم چیزای خوبی یادگرفتم.`
)

(h5 
  `13. `
  `آمار و احتمال`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _ `کم` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `خیلی کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `کم` )
  (sp (b `تلاش برای یادگیری`) `:` _ `کم` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `راضی` )
  )

(img `bayes-theorem.jpg` `height: 300px` `Bayes Theorem`  )

(p 
  `راستش این درس جزء دروسی که خریدم، نبود اما یکمی با هوش مصنوعی مسئله مشترک داشت` _ 
  `و چند تا حل از استاد گیلک دیده بودم و تونستم 2 تا تست از 5 تا بزنم.`
  `با اینکه درس ساده ای بود اما استاد رضوی گفته بود حذف کنید 😑`
  )


(h5 
  `14. `
  `زبان`)

(ul
  (sp (b `چیزی که فکر میکردم از درس میدونم`)`:` _ `کم` )
  (sp (b `چیزی که واقعا از درس میدونستم`)`:` _ `کم` )
  (sp (b `چیزی که تا آخر کنکور از درس میدونستم`) `:` _ `کم` )
  (sp (b `تلاش برای یادگیری`) `:` _ `تقریبا هیچ` )
  (sp (b `نتیجه  درس در کنکور`) `:` _ `خوب` )
  )

(p
  `غیر از سوالای گرامر، بقیه رو زدم. به نظرم از سال های پیش آسون تر بود.`)

(p 
  `این یکی هم جزء دروسی که خریدم نبود، صرفا خواستم بازخورد نتیجه ام رو بنویسم.`)

(hr)
(h4 
  `پلتفرم آزمون`)

(p 
  `یکی از سرویس هایی که سایت کنکور کامپیوتر ارائه میده` _ 
  (sm `(که باید جدا خریداری بشه)`) _ 
  `"پلتفرم آزمون"` _ 
  `هست؛` _
  `صرفا یک سایتیه که سوالات کنکور رو از زمان های قدیم داره تا به امروز و شما میتونید از خودتون آزمون بگیرید.` _ 
  `پاسخنامه اش اشتباه علمی و تایپی زیاد داره و حتی بعضی موقع ها حال نداشته همه گزینه هارو تحلیل کنه که واقعا عیب بزرگی محسوب میشه.` _ 
  `اما خب اگر درس خوندید، برای یادآوری مباحث خوبه.` _ 
  )

(p 
  `اگر قصد خرید دارید پیشنهاد من اینه که زود بخرید، حتی اگر فقط هفته آخر میخواید استفاده کنید؛ چون قیمت اش رو هی بالا و پایین میکنن`
  )

(hr)
(h4 
  `آزمون های آزمایشی`)

(p 
  `آزمون های آزمایشی کنکور کامپیوتر که به همراه دوره نکته و تست خریدم،` _ 
  `با اینکه ادعا کرده بودن که` _ 
  (i `"نزدیک ترین نمونه سوالات به کنکور"`) _ 
  `هست، اما به شدت بد و دور از کنکور بود.`
  )

(p 
  `به نظرم به هیچ عنوان آزمون های آزمایشی کنکور کامپیوتر رو نخرید که خیلی خیلی آشغاله و وقت تلف کردنه.` _ 
  `همون پلتفرم آزمون کافیه`
  )

(p 
  `در مورد آزمون های آزمایشی بقیه موسسات آموزشی نظری ندارم چون ندیدم`)

(hr)
(h4 
  `اگر به گذشته برگردم`)

(p
  `اول از همه خدا رو شکر میکنم که فرصت کنکور خوندن رو بهم داد و من رو از سردرگمی در اورد.`
  )

(p 
  `اگر برگردم به گذشته، احتمالا دوره های موسسه بابان رو تهیه کنم.` _ 
  `ناراحت نیستم از اینکه دوره های استاد رضوی رو تهیه کردم،` _ 
  `چون اولا تنها چیزی بود که توی اون برهه زمانی به ذهنم رسید` _ 
  `و دوم اینکه شاید بعضی درس هایی که خوب درس نمیداد مثل شبکه و الگوریتم و پایگاه داده، خدا راه هایی برای جبرانش بهم نشون داد.`
  )

(hr)
(h4 
  `نتیجه نهایی`)

(p 
  `اوایل که شروع به خوندن کردم، این استدلال رو داشتم که مثل این` _ 
  `ChatGPT` _ 
  `هرچی بیشتر سوال حل کنم، دانش بیشتر میشه و میتونم سوال های بیشتری جواب بدم.` _ 
  `خب حداقل بعد از اومدن کلید اولیه متوجه شدم که این فرض اصلا درست نیست 😁.`
  )

(p 
  `با اینکه من خیلی تست حل کرده بودم` _ 
  (sm `(یک دور با ویدئو ها و یک دور با پلتفرم آزمون)`) `،` _ 
  `اما در بعضی از درس ها مثل هوش مصنوعی به` _ 
  (b `فهم`) _ 
  `نرسیده بودم. که البته دلایل زیادی داره مثل نحوه تدریس دکتر رضوی و البته فرضیات اشتباه خودم.` _ 
  )

(p
  `دیدن ویدئو های دانشگاه` _ 
  `MIT` _ 
  `برای یادگیری الگوریتم و عدم فهم عمیق توی درس هوش مصنوعی،` _ 
  `پرسش هایی رو در من به وجود اورد که پایه  گذار` _ 
  (a `https://github.com/hamidb80/theory-of-understanding` `فرضیه فهمیدن`) _ 
  `شد. خدارو شکر میکنم که به اشتباهم پی بردم و به این فرضیه خوشبین هستم`
  )

(p
  `همونطور که گفتم، برای اینکه وسط درس خوندن خوابم نگیره، چند تا وسیله ورزشی خریدم` _ 
  `و صبح ها و در طول روز باهاش کمی ورزش میکردم. توی زندگیم هیچ موقع انقد سحر خیز و با برنامه نبودم!!!` _ 
  `جدای از اینکه نتیجه کنکورم قراره چی بشه، عادت های خوبی در من به وجود اومد و درس هایی که هیچ موقع نمیخواستم سمت شون برم؛` _ 
  `مثل الگوریتم و شبکه رو خوندم و حتی یاد گرفتمشون.`
  )

(hr)
(h4 
  `خدا، ماه رمضان، آینده`)

(p  
  `بعضی از اساتید کنکور به عنوان مشاوره به دانشجو ها میگن که کنکور از دستور خدا واجب تره` _ 
  `و اگر آینده تون رو دوست دارید، نباید روزه بگیرید چون مانع درس خوندن میشه.`
  )

(p 
  `اما چند تا نکته رو در نظر نمیگیرن:`)

(ol
  (sp 
    `خداروشکر ماه رمضان توی اسفنده و با کنکور سال بعد تداخل نداره، حتی کنکور یک ماه و نیم بعد از ماه رمضانه`)
  (sp 
    `در ظاهر ممکنه روزه گرفتن باعث کم شدن انرژی و در نهایت کمتر شدن رتبه از بقیه بشه.` _ 
    `اما ما که اعتقاد داریم زمان و مکان و همه دنیا گوش به فرمان خداست، خدا میتونه جور دیگه براتون جبران کنه: `

    (ul
      (sp
        (b `برکت وقت:`) _  
        `خدا میانبر هایی سر راه تون قرار میده که مثلا مبحث فلان رو بجای یک هفته، توی 3 روز تموم کنید`)
      (sp 
        (b `فرصت های ممتاز:`) _ 
        `شاید دانشگاه با رتبه علمی پایین تر قبول بشید، اما از کجا معلوم موقعیتی توی مکان و زمان حاصی اتفاق نفیفته که باعث پیشرفت شما حتی بیشتر از فردی که در بهترین دانشگاه درس خونده بشه؟`))
    )
  )

(p 
  `دنیا خیلی پیچیده تر از اونیه که بشه پیشبینی اش کرد. مطئمن باشید اگر وقتی بین دوراهی گیر کردید دستور خدا رو انتخاب کنید، خدا خیلی بهتر از اون چیزی که ازش گذشتید رو بهتون میده.` _ 
  `این تصویر خلاصه چیزاییه که گفتم:`)

(img `money-time-future-god.jpg` `height: 420px;` )
(ul 
  (sp 
    (b `پول`) _ 
    `میگوید: مرا بدست بیاور، بقیه را فراموش کن`)
  (sp 
    (b `زمان`) _ 
    `میگویند: مرا دنبال کن، بقیه را فراموش کن`)
  (sp 
    (b `آینده`) _ 
    `میگوید: برای من تلاش کن، بقیه را فراموش کن`
    )
  (sp 
    (b `خدا`) _ 
    `میگویند: فقط مرا یاد کن،` _ 
    (i `همه چیز`) _ 
    `را به تو میدهم` 
     )
  )

(img `surah-065-aya-002.webp` `height: 400px` 
  `هرکس تقوای الاهی پیشه کند خداوند راه نجاتی برای او فراهم میکند، و از جایی که گمان ندارد روزی میدهد`)

(hr)
(h4 
  `ابزار ها`)

(h5 
  `مرورگر` _ 
  (a `https://zen-browser.app/` `Zen`)
  )

(p 
  `مرورگر های معمولی اینطورین که همش باعث حواس پرتی میشن.` _ 
  `اما این مرورگر تقریبا تمام حواس پرتی هارو حذف میکنه و به صورت تمام صفحه` _ 
  (sm `(full-screen)`)
  `میتونید کتاب بخونید یا وب گردی کنید.` _ 
  `این مورد برای منی که ذهن ماجرا جویی دارم خیلی مفید بود و تونستم بیشتر تمرکز کنم`
  )

(h5 
  `هوش مصنوعی` _ 
  (a `https://www.phind.com/` `Phind`))

(p
  `از این هوش مصنوعی برای پیدا کردن مطالب علمی مثل خیلی از فایل های` _ 
  `PDF` _ 
  `ای که توی متن لینکشو گذاشتم استفاده کردم. خیلی موقع ها بهتر از گوگل عمل میکنه`
  )

(h5 
  `هوش مصنوعی` _ 
  (a `https://chat.deepseek.com/` `DeepSeek`))

  (p 
    `از این هوش مصنوعی برای تبدیل مطالب حفظی به شعر انگلیسی استفاده میکردم. واقعا عالی بود!!`)

  (p 
    `مثلا این شعر رو برای نحوه کار ` _ 
    `DHCP` _ 
    `ساخته: `
    )
  (p 
(b `The DHCP Dance`) (br)
(br)
`When a client needs an IP to explore,` (br)
`It starts with a Discover, shouting, "I need more!"` (br)
`It sends out a broadcast, far and wide,` (br)
`Hoping a ` (i `DHCP server`) ` will reply.` (br)
(br)
`A ` (i `DHCPOFFER`)_ `—an IP to own.` (br)
`The server then offers, with a cheerful tone,` (br)
`"Here's an address, subnet, and lease to keep,` (br)
`Use it wisely, and your network will leap!"` (br)
 (br)
`The client responds with a Request so clear,` (br)
`"Thank you, server, this IP I'll hold dear."` (br)
`It asks for the address, with a hopeful plea,` (br)
`"Please assign it to me, so I'm trouble-free!"` (br)
 (br)
`The server agrees, with an Acknowledgment bright,` (br)
`Sending `(i `DHCPACK`) ` to seal the deal right.` (br)
`Now the client's online, ready to soar,` (br)
`Thanks to the magic of ` (b `D-O-R-A!`) )

(hr)
(h4 
  `نکات دیگر`)

(ul 
  (sp 
    `فیلم هارو روی` _ 
    `2x` _ 
    `یا` _
    `1.5x` _ 
    `بزارید چون معمولا اساتید خیلی کند حرف میزنن`
    )
  (sp 
    `به دوستاتون هم کمک کنید 🙂`)
  )
]