[
(c
  (h3 
    `تجربیات من از کنکور 1404 مهندسی کامپیوتر`))

(hr)
(h4 
  `انگیزه برای خوندن`)

(p
  `زمانی که ترم 8 بودم و همش نگران این بودم که درسم رو چطور تموم کنم و بعدش چیکار کنم، یکی از همکلاسیام` _ 
  (b `رتبه تک رقمی`) _ 
  `کنکور شده بود.` _ 
  `با این اتفاق راستش منم رتبه خوب شدن رو چیز دوری ندیدم و تصمیم گرفتم که شروع کنم.` _ 
  )

(p
  `علاوه به اون، جو غیر علمی دانشگاه دوره کارشناسی واقعا من رو از این دانشگاه زده کرد.` _ 
  `خیلی سخته بخوام همه اش رو بگم ولی مهم ترینش این بود که آدمای اطرافم مخصوصا جایی که کار میکردم، خیلی جاهل بودن.  ` _ 
  `اینطوری بودن که فکر میکردن چون توی فلان شرکت کار میکنن دیگه الان خدای کامپیوتر و برنامه نویسی اند و حرف های منطقی من رو گوش نمیکردن.` _ 
)

(p
  `جالبه بدونید چنین آدم هایی بر اساس ریاضی دبیرستان توصیف میشن:` _ 
  (b `آدم های اکسترمم نسبی`)
)

(img "local-maxima.png" "height: 300px")

(p 
  `این آدم ها بخاطر جاهلیت شون فکر میکنن چیزی که الان هستن آخر دانش هست و درست  ترین روش پیشرفت رو در پیش گرفتن.` _ 
  `اما در صورتی که با واقعیت خیلی فاصله دارن.`
  )

(p
  `عدم توجه مسئولین دانشگاه به رشته مهندسی هم من رو به شدت عصبانی میکرد و ` _
  (b `واقعا پیشرفت خودم رو توی این دانشگاه نمیدیدم.`) _ 
  `علاوه بر اون اگر ادامه تحصیل نمیدادم باید میرفتم سربازی.` _

  `یادم میاد دقیقا یکسال قبل این تصمیم، به خدا میگفتم که` _ 
  (i 
    `یعنی قراره بعد از دانشگاه چیکار کنم؟؟`))

(hr)
(h4 
  `روند`)


(p
 `نزدیکای ماه مهر بود که شروع کردم.` _ 
 `پکیج نکته و تست سایت` _ 
 (a "https://www.konkurcomputer.ir/" `کنکور کامپیوتر`) _ 
 `رو خریدم، صرفا بخاطر اینکه همکلاسی ام که رتبه تک رقمی شده بود هم از همین سایت خریده بود.`)

(p
  `اون موقع ترم 9 بودم و درس زیادی نداشتم. صرفا یکی دوروز دانشگاه بودم و اون روز ها هم فقط یک کلاس داشتم.` _
  `البته هفته ای یکروز هم دور کار (برنامه نویسی) برای یک شرکت انجام میدادم ولی زودی تمومش کردم و نذاشتم خیلی به درس خوندنم لطمه بزنه`
  )

(p
  `اوایل که شروع کردم یکمی وسط درس خوندن خوابم میبرد، بخضی از پولی که بدست اورده بودم` _ 
  `رو صرف خرید ` _

  (a `https://www.digikala.com/product/dkp-6497713/لوازم-تناسب-اندام-تی-آر-ایکس-تی-آر-ایکس-مدل-فورس-کیت/` `TRX`) _ 
  `و` _ 
  (a `https://www.digikala.com/product/dkp-8519098/کش-ورزشی-تن-زیب-مدل-ضربدری-corex-30lb/` `کش ورزشی`) _ 

  `کردم و هر موقع که احساس خواب آلودگی میکردم یکم باهاشون کار میکردم تا بتونم درس خوندن رو ادامه بدم.`
  )

(p
  `تقریبا از صبح تا شب درس میخوندم (به علاوه استراحت های وسطش).` _ 
  `اینطوری که صبح برای نماز صبح بیدار میشدم و میرفتم مسجد. بعد که میومدم خونه،` _ 
  `یکم ورزش میکردم و بعد صبحونه میخوردم و مینشستم پای درس` _ 
  (sm 
    `(البته بعضی موقع ها هم این برنامه بهم میریخت)`)
)

(p
  `از روزی 4 یا 5 ساعت شروع کردم و کم کم بیشتر شد.` _ 
   `یادمه اولین باری که 12 ساعت درس خوندم تا دو روز تب کردم` _ 
  `تصمیم گرفتم که در حد همون روزی 10 ساعت باقی بمونه.` _ 
  (sm
    `البته چند باری هم بیشتر میشد که عاقبتش مثل قبل باعث تب کردنم میشد 😅` )
)

(p
  `واقعا اون روز ها بهترین دوران زندگی ام بود.`
  )

(hr)
(h4
  `کیفیت دوره ها`)

(p
  `من بسته "12 نکته و تست" رو خریدم` _ 
  (sm `(یعنی درسنامه نخریدم)`) _ 
  `و نظرم در مورد هر کدوم اینطوریه:`
)

(h5 
  `1. شبکه های کامپیوتری`)

(p
  `کلاس های ضبط شده واسه سال 1401 بود که با اغتشاشات همراه شده بود.` _ 
  `با اینکه من دوره "نکته و تست" گرفته بودم ولی درس نامه هم داشت.` _ 
  `شاید فکر کنید که این مورد خوبه اما به شدت کیفیت درس دادن پایین بود و در حد جزوه نویسی و تست حل کردن بود.`
  `حتی تست حل کردن ها هم بدرد نمیخوره چون چند سالی هست که شبکه اصلا سوال محاسبه ای نداره و همه اش حفظی یا مفهومیه.`
  `همون اول قید خوندن شبکه رو زدم، تا اینکه یکی از دوستان عزیزم بهم` _
 _
  (a
    `https://cshub.ir/product/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D9%88-%D8%AA%D8%B3%D8%AA-%D9%85%DB%8C%DA%A9%D8%B1%D9%88-%D8%B4%D8%A8%DA%A9%D9%87-%D9%87%D8%A7%DB%8C-%DA%A9%D8%A7%D9%85%D9%BE%DB%8C%D9%88%D8%AA%D8%B1%DB%8C/`
    `دوره میکرو شبکه`) _ 

  `رو معرفی کرد. این دوره درحال ضبط📹 بود` _ 
   `و طوری نبود که همه چیز رو متوجه بشید. اما یکسری خوبی داشت که جای دیگه پیدا نکردم:`
)

(ul
  (sp `دوره کوتاه بود و تست هم حل میکرد`)
  (sp `استاد منبع برای توضیح بیشتر معرفی میکرد و مثل استاد مغرور کنکور کامپیوتر ادعا های الکی نداشت`)
  )

(p
  `این موارد باعث شد که با منابعی که خود نویسنده کتاب تولید کرده و` _ 
  (b `رایگان`) _ 
  (a `https://gaia.cs.umass.edu/kurose_ross/index.php` `به اشتراک گذاشته`) _ 
  `آشنا بشم، که واقعا هم کم نبودن:`
  )

(ul
  (sp `خود کتاب`)
  (sp `سوال های حل شده آخر فصل`)
  (sp `اسلاید و ویدئوی درسنامه`)
  (sp `سایت آزمون`)
  )

(p
  `همه اینا مجانی توی اینترنت بود!` _ 
  `یعنی از اساتید کنکور گرامی دانشجو رو گول میزنن وقتی که مینویسن:` _ 
  (i `"آموزش شبکه های کامپیوتر + حل تمرینات آخر فصل"`) _ 
  `چون حل تمرینات آخر فصل اصلا توی اینترنته!` _ 
  `همینطور اسلاید ها و درسنامه!`
  )

(p 
  `دوره رو تا جایی که ضبط شده بود دیدم، بعد کتاب رو هم تا کامل خوندم و علامت زدم.` _ 
  `جواب تمرینات آخر فصل هم دانلود کردم و در مورد در مبحثی که هنوز هم واسم سوال بود،` _ 
  `توی` _ 
  `youtube` _ 
  `جستجو میکردم و میدیدم.`
  `با اینکه چند یکی از سوالای کنکور شبکه خارج از سرفصل بود و اون یکی دیگه هم خیلی چرند بود، بقیه رو خوب زدم` 
  )

(h5 
  `2. ساختمان داده و طراحی الگوریتم`)



# (hr)
# (h4 
#   `اگر به گذشته برگردم`)

# (hr)
# (h4 
#   `نتیجه نهایی`)

# (p 
#   `فرضیه فهمیدن`)
# (p 
#   `خوندن الگوریتم و شبکه`)

# (p 
#   `خرید وسایل ورزشی`)

# (hr)
# (h4 
#   `آیا منم کنکور بخونم؟`)

# (hr)
# (h4 
#   `خدا، ماه رمضان، آینده`)

# money says .., time says, future says, God says
# تجربه نماز مسجد و ترک مسجد
]